%-----------------------------
%       Ασαφείς κανόνες
%-----------------------------

%-------------------------------------------------
% Εντολές που μπαίνουν στην αρχή κάθε προγράμματος
close all;
clear all;
clc;
format long;

%--------------------------------------------------------------------------------------------------
% Πεδία ορισμού της εισόδου και της εξόδου

LOWER_X=0;    UPPER_X=100;
LOWER_Y=0;    UPPER_Y=10;

x=linspace(LOWER_X,UPPER_X,1001);
y=linspace(LOWER_Y,UPPER_Y,1001);

%--------------------------------------------------------------------------------------------------
% Κάλυψη του χώρου εισόδου με π.χ. 3 Γκαουσιανές συναρτήσεις συμμετοχής.
% Στη γενική περίπτωση οι παράμετροι m και σ δίνονται από τον χρήστη.

mf_input(1,:)=exp(-0.5*x.^2/(15^2));
mf_input(2,:)=exp(-0.5*((x-50).^2)/(15^2));
mf_input(3,:)=exp(-0.5*((x-100).^2)/(15^2));
plot(x,mf_input(1,:),'b',x,mf_input(2,:),'r',x,mf_input(3,:),'g');
title('Input space: blue->Low,     red->Medium,     green->High');

%--------------------------------------------------------------------------------------------------
% Κάλυψη του χώρου εξόδου με π.χ. 3 Γκαουσιανές συναρτήσεις συμμετοχής.
% Στη γενική περίπτωση οι παράμετροι m και σ δίνονται από τον χρήστη.

mf_output(1,:)=exp(-0.5*y.^2/(1.2^2));
mf_output(2,:)=exp(-0.5*((y-5).^2)/(1.2^2));
mf_output(3,:)=exp(-0.5*((y-10).^2)/(1.2^2));

figure(2);
plot(y,mf_output(1,:),'b',y,mf_output(2,:),'r',y,mf_output(3,:),'g');
title('Output space: blue->Slow,     red->Moderate,     green->Fast');
%--------------------------------------------------------------------------------------------------
% Yπολογισμός της εξόδου ενός ασαφούς κανόνα της μορφής: IF x is A ΤΗΕΝ y is Β 
% Έστω Α = Low, Β = Moderate και Α' = γκαουσιανή με m=20 και σ=5.
% Γίνεται υπολογισμός τόσο για τελεστή Mamdani (min) όσο και για τελεστή Larsen (αλγεβρικό γινόμενο)

mf_x_bar=exp(-0.5*((x-20).^2)/(5^2));
w=max(min(mf_x_bar,mf_input(1,:)))
mf_y_bar_Mamdani=min(w,mf_output(2,:));
mf_y_bar_Larsen=w*mf_output(2,:);

figure(3)
subplot(3,1,1);
plot(x,mf_input(1,:),'b',x,mf_x_bar,'r');
title('blue line: A     red line: A''')

subplot(3,1,2);
plot(y,mf_output(2,:),'b');
hold on;
fill(y,mf_y_bar_Mamdani,'r');  % αντί για plot, για να γεμίσει με χρώμα το σύνολο Β'
title('Mamdani operator: blue line: B     red line: B''')

subplot(3,1,3);
plot(y,mf_output(2,:),'b');
hold on;
fill(y,mf_y_bar_Larsen,'r');
title('Larsen operator: blue line: B     red line: B''')
