%-----------------------------------------------------------------------
% Αναγνώριση συστήματος με ασαφές σύστημα τύπου Mamdani 5 και 9 κανόνων με τριγωνικές συναρτήσεις συμμετοχής
% και 5 κανόνων με γκαουσιανές συναρτήσεις συμμετοχής.
% Τα FIS δημιουργήθηκαν με το Fuzzy Logic Toolbox.
% Εφαρμογή: συνάρτηση συνημιτόνου
% To σύστημα δεν υφίσταται εκπαίδευση.
%-----------------------------------------------------------------------
clc;
clear all;
close all;
%-----------------------------------------------------------------------
x=linspace(0,360,361);
yd=5*cos(2*pi*x/360); % επιθυμητή έξοδος
%-----------------------------------------------------------------------
fis_5_rules=readfis('cos_5rules.fis'); % έξοδος του ασαφούς συστήματος
y5=evalfis(x,fis_5_rules);
plot(x,y5,x,yd,'r');
hold on
%-----------------------------------------------------------------------
fis_9_rules=readfis('cos_9rules.fis'); % έξοδος του ασαφούς συστήματος
y9=evalfis(x,fis_9_rules);
plot(x,y9,'g');
%-----------------------------------------------------------------------
fis_5_rules_gaussMF_and=readfis('cos_5rules_gaussMF_and.fis'); % fuzzy system output
y5gauss_and=evalfis(x,fis_5_rules_gaussMF_and);
plot(x,y5gauss_and,'y');
%-----------------------------------------------------------------------
clc
